/* 假设现在需要做一个轮播图，该轮播图能够支持多种播放方式（如渐显渐隐，左右滑动切换，上下滑动切换）。
请说明你会如何设计模块，组织模块间的沟通；。并设想如要实现该轮播图的需求，我们可以用到什么设计模式。
提交说明：

（1）无需提交代码，请提交设计图及说明文档，说明其中哪个需求会用到什么设计模式，大体设计思路如何。

（2）提交时将图片及说明文档（word或pdf格式）打包为zip文件，
命名为“设计模式1-云课堂昵称”，如“设计模式1-周星星”。 */


/* 请为项目设计一个商品信息缓存器，需求描述如下：
（1）可根据商品id判断商品是否加载过，如果加载过，直接从缓存里拿；如没有，则请求；
（2）如果是热门商品，缓存于全局的对象里；如果是非热门商品，则缓存于localStorage中；
全局对象和localStorage中的商品数量上限可以配置；
（3）可主动调用api来更新某个商品的信息。

提交说明：

（1）需要给出代码，可略过某些非核心代码；

（2）如代码量大，请打包为zip压缩文件提交，文件命名为“设计模式2-云课堂昵称”，如“设计模式2-周星星”；

（3）如代码量较小，可直接粘贴在下方答题文本框中。 */